# BendingDetailTypeSegmentLengthDimensionsEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeSegmentLengthDimensionsEnabled Property
ParameterTypeId Class See Also
---
"Segment Length Dimensions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionsEnabled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionsEnabled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace